CREATE DATABASE HomeWork  
ON							  -- Задаем параметры Базы Данных.
(
	NAME = 'HomeWork',				-- Указываем логическое имя БД (используется при обращении к БД).
	FILENAME = 'D:\HomeWork.mdf',	-- Указываем Физическое полное имя файла БД.
	SIZE = 10MB,                    -- Задаем начальный размер файла БД.
	MAXSIZE = 100MB,				-- Задаем максимальный размер файла БД.
	FILEGROWTH = 10MB				-- Задаем значение, на которое будет увеличиваться размер файла БД.
)
LOG ON						  -- Задаем параметры журнала Базы Данных.
( 
	NAME = 'LogHomeWork',				   -- Указываем логическое имя журнала БД (используется при обращении к журналу БД).
	FILENAME = 'D:\HomeWork.ldf',      -- Указываем Физическое полное имя файла журнала БД.
	SIZE = 5MB,                        -- Задаем начальный размер файла журнала БД.
	MAXSIZE = 50MB,                    -- Задаем максимальный размер файла журнала БД.
	FILEGROWTH = 5MB                   -- Задаем значение, на которое будет увеличиваться размер файла журнала БД.
)               
COLLATE Cyrillic_General_CI_AS -- Задаем кодировку для базы данных по умолчанию



--********************************************************************************
--                  Создание Таблицы в Базе Данных HomeWork.

USE HomeWork               
GO   

----------------------------------------------------------------------------------
--Создайте таблицу Product с колонками: 
--ProductId, Name, ProductNumber, Cost, Count, SellStartDate.   

CREATE TABLE Product
(

	ProductId smallint IDENTITY NOT NULL,
	Name Varchar(20) NOT NULL,
	ProductNumber char(10) NOT NULL,
	Cost money NOT NULL,
	[Count] integer NOT NULL,
	SellStartDate date NOT NULL   
)
GO

--********************************************************************************
--                  Внесение данных в таблицу Product.
--********************************************************************************

INSERT INTO Product
(Name,ProductNumber,Cost, [Count] ,SellStartDate) 
VALUES 
('Корона',   'AK-53818 ', '$5',  '50',  '08/15/2011 '),
('Милка',    'AM-51122 ', '$6.1','50',  '07/15/2011 '),
('Аленка',   'AA-52211 ', '$2.5','20',  '06/15/2011 '),
('Snickers', 'BS-32118',  '$2.8','50',  '08/15/2011 '),
('Snickers', 'BSL-3818',  '$5',  '100', '08/20/2011 '),
('Bounty',   'BB-38218 ', '$3',  '100', '08/01/2011 '),
('Nuts',     'BN-37818',  '$3',  '100', '08/21/2011 '),
('Mars ',    'BM-3618 ',  '$2.5','50',  '08/24/2011 '),
('Свиточ',   'AS-54181 ', '$5',  '100', '08/12/2011 '),
('Свиточ',   'AS-54182 ', '$5',  '100', '08/12/2011 ');
GO

/*
Cделайте выборку для продукции количество которой больше 59 шт. 
*/

SELECT * FROM Product
WHERE [Count] > 59;

/*
Сделайте выборку для продукции цена которой больше 3$ и поступили на продажу c 20/08/2011.  
*/

SELECT * FROM Product
WHERE Cost > 3 and SellStartDate = '08/20/2011';

/*
Шоколад Свиточ подорожал на 25 центов, измените запись. 
*/

UPDATE Product
SET Cost = $5.25 
WHERE Name = 'Свиточ'
GO

SELECT * FROM Product;

----------------------------------------------------------------------------------